[
    {
        "title": "Socceroos FIFA World Cup 2026 times, dates and locations set, with games in Vancouver, Seattle and Santa Clara",
        "url": "https://www.abc.net.au/news/2025-12-07/socceroos-set-for-wild-west-north-american-world-cup-adventure/106111662",
        "description": "Australia's North American west coast adventure at the World Cup is confirmed, with matches in Vancouver, Seattle and Santa Clara in California."
    },
    {
        "title": "Ohio State injury report: 6 Buckeyes ruled out for Big Ten Championship against Indiana",
        "url": "https://www.10tv.com/article/sports/football/ohio-state-football/ohio-state-indiana-big-ten-championship-injuries/530-b0996e4e-7596-4f05-9d02-ff9d625a8259",
        "description": "Ohio State will be without 6 Buckeyes for the Big Ten Championship against Indiana."
    },
    {
        "title": "Samsung Brings Galaxy S25 Ultra to SLS Super Crown World Championship, Opening a New View of Skateboarding’s Biggest Stage",
        "url": "https://news.samsung.com/global/samsung-brings-galaxy-s25-ultra-to-sls-super-crown-world-championship-opening-a-new-view-of-skateboardings-biggest-stage",
        "description": "Galaxy S25 Ultra positioned onto the course will capture multi-view footage — bringing fans closer to the action than ever before"
    },
    {
        "title": "Greece: At least 17 dead in boat capsize off Crete",
        "url": "https://www.dw.com/en/greece-at-least-17-dead-in-boat-capsize-off-crete/a-75048685",
        "description": "Two survivors attempting to cross the Mediterranean Sea were rescued after a boat carrying migrants capsized off the coast of Crete. Authorities have not said where the vessel came from."
    },
    {
        "title": "Lionel Messi inspires Inter Miami to MLS Cup glory as David Beckham leads emotional celebrations",
        "url": "https://talksport.com/football/3798955/lionel-messi-david-beckham-inter-miami-win-mls-cup/",
        "description": "Lionel Messi assisted two goals as he and Inter Miami beat Vancouver Whitecaps 3-1 to win the MLS Cup.An own-goal from Edier Ocampo put the Floridian"
    },
    {
        "title": "SpaceX to offer insider shares at record-setting $800 billion valuation",
        "url": "https://fortune.com/2025/12/06/spacex-insider-shares-transaction-more-valubale-than-openai/",
        "description": "Elon Musk on Saturday denied that SpaceX is raising money at a $800 billion valuation without addressing Bloomberg’s reporting on the planned offering of insiders’ shares."
    },
    {
        "title": "Embark dishes on all the goodies you'll get in Arc Raiders if you choose to prestige later this month",
        "url": "https://www.rockpapershotgun.com/embark-dishes-on-all-the-goodies-youll-get-in-arc-raiders-if-you-choose-to-prestige-later-this-month",
        "description": "Arc Raiders' Expedition Project kicks off later this month, giving you the option to completely reset your progress, in exchange for a few bonuses."
    },
    {
        "title": "Trump Makes Prediction About Hosting Kennedy Center Honors",
        "url": "https://deadline.com/2025/12/trump-kennedy-center-honors-host-jimmy-kimmel-1236638766/",
        "description": "The president said that he will do better than Jimmy Kimmel"
    },
    {
        "title": "Former police boss claims he told ministers about McSkimming allegations",
        "url": "https://www.odt.co.nz/news/national/former-police-boss-claims-he-told-ministers-about-mcskimming-allegations-rnz",
        "description": "Andrew Coster says he briefed both former police minister Chris Hipkins and current Police Minister Mark Mitchell about allegations being made..."
    },
    {
        "title": "What happened to Susan Dell's face? Experts share insight on plastic surgery claims; 'before-after' pics go viral",
        "url": "https://www.hindustantimes.com/world-news/us-news/what-happened-to-susan-dells-face-experts-share-insight-on-plastic-surgery-claims-before-after-pics-go-viral-101765059365961.html",
        "description": "Susan and Michael Dell, were photographed when they announced a $6.2 billion donation to ‘Trump Accounts’, and her appearance sparked concerns."
    }
]